Repository: KurtJacobson/axis-historical
Catalog: i18n/*.po
Languages: de, fr

source: Emergency stop
de: Not Aus
fr: Arret d'urgence

source: Turn machine on
de: Maschine an
fr: Puissance machine on

source: Activate first axis
de: Aktiviere erste Achse
fr: Activer premier axe

source: Activate second axis
de: Aktiviere zweite Achse
fr: Activier deuxieme axe

source: Activate third axis
de: Aktiviere dritte Achse
fr: Activer troisieme axe

source: Activate fourth axis
de: Aktiviere vierte Achse
fr: Activer quatrieme axe

source: Activate fifth axis
de: Aktiviere fünfte Achse
fr: Activer cinquieme axe

source: Activate sixth axis
de: Aktiviere sechste Achse
fr: Activer sixieme axe

source: Select jog increment
de: Wähle Jog Inkrement
fr: Selectionner l'increment du deplacement

source: Continuous jog
de: Durchgehend joggen
fr: Deplacement continu

source: Send active axis home
de: Sende aktive Achse zur Referenzposition
fr: Envoyer l'axe actif a la position Home

source: Set G54 offset for active axis
de: Setze G54 Offset für die aktive Achse
fr: Fixe la nouvelle origine G54 pour l'axe actif

source: Jog first axis
de: Jogge erste Achse
fr: Deplace le premier axe

source: Jog second axis
de: Jogge zweite Achse
fr: Deplace le deuxieme axe

source: Jog third axis
de: Jogge dritte Achse
fr: Deplace le troisieme axe

source: Jog fourth axis
de: Jogge vierte Achse
fr: Deplace le quatrieme axe

source: Left Button
de: Linke Taste
fr: Fleche gauche

source: Pan view or select line
de: Ansicht kippen oder Linie auswählen
fr: Vue panoramique ou selectionner la ligne

source: Shift+Left Button
de: Shift+Linke Taste
fr: Majuscule+Fleche gauche

source: Rotate view
de: Ansicht rotieren
fr: Faire pivoter la vue

source: Right Button
de: Rechte Taste
fr: Fleche Droite

source: Zoom view
de: Ansicht zoomen
fr: Zoommer

source: Wheel Button
de: Maus Rad Taste
fr: Molette de la souris

source: Rotate Wheel
de: Maus Rad
fr: Tourner la molette

source: Manual control
de: Manuelle Kontrolle
fr: Controle manuel

source: Code entry (MDI)
de: Kodeingabe (MDI)
fr: Commande manuelle (MDI)

source: Override Limits
de: Grenzwerte aufheben
fr: Ignorer les limites

source: Open program
de: Programm öffnen
fr: Ouvrir programme

source: Run program
de: Program ausführen
fr: Demarrer programme

source: Step program
de: Programmschritt
fr: Avancer d'un pas dans le programme

source: Pause program
de: Programmpause
fr: Pause

source: Resume program
de: Programm fortfahren
fr: Reprendre

source: Stop program
de: Programm stoppen
fr: Stopper

source: Toggle mist
de: Nebel ändern
fr: Aspiration On/Off

source: Toggle flood
de: Kühlmittel ändern
fr: Arrosage On/Off

source: Spindle brake off
de: Spindelbremse aus
fr: Liberer la broche

source: Spindle brake on
de: Spindelbremse an
fr: Freiner la broche

source: Turn spindle clockwise
de: Spindel dreht im Urhzeigersinn
fr: Broche sens horaire

source: Turn spindle counterclockwise
de: Spindel dreht gegen Uhrzeigersinn
fr: Broche sens antihoraire

source: Turn spindle more slowly
de: Spindel langsamer
fr: Ralentir broche

source: Turn spindle more quickly
de: Spindel schneller
fr: Accelerer broche

source: Clear live plot
de: Ansicht löschen
fr: Effacer la trace de l'outil

source: Cycle among preset views
de: Zwischen vorgegebenen Ansichten wechseln
fr: Passer a la vue preselectionnee

source: AXIS error
de: AXIS fehler
fr: Erreur Axe

source: No tool
de: Kein Werkzeug
fr: Pas d'outil

source: Unknown tool %d
de: Unbekanntes Werkzeug %d
fr: Outil %d inconnu

source: Tool %d, offset %g, radius %g
de: Werkzeug %d, Offset %g, Radius %g

source: Program_filter %r failed
de: Programmfilter %r nicht erfolgreich
fr: Filtre %r : echec

source: Exit code %d
de: Endcode %d
fr: Code sortie %d

source: Unknown error %s
de: Unbekannter fehler %s

source: Continuous
de: Durchgehend
fr: Continu

source: {{rs274ngc files} {.ngc}} {{All files} *}
de: {{rs274ngc Dateien} {.ngc}} {{Alle Dateien} *}

source: Program exceeds machine minimum on axis %s
de: Programm überschreitet unteren Grenzwert auf Achse %s
fr: Limite inférieure dépassee sur l'axe %s

source: Program exceeds machine maximum on axis %s
de: Programm überschreitet oberen Grenzwert auf Achse %s
fr: Limite superieure depassee sur l'axe %s

source: Program exceeds machine limits
de: Programm überschreitet Maschingrenzwerte
fr: Limites machines depassees

source: Run Anyway
de: Trotzdem ausführen
fr: Demarrage force

source: Cancel
de: Abbrechen
fr: Annulle

source: Show EMC Status
de: Zeige EMC Status
fr: Voir l'etat EMC

source: _Open
de: Ö_ffnen
fr: _Ouvrir

source: _Quit
de: _Beenden
fr: _Quitter

source: _Copy
de: _Kopieren

source: _Step
de: _Schritt
fr: Avancer d'une _ligne

source: Re_sume
de: Fort_setzen

source: _File
de: _Datei
fr: _Fichier

source: _Edit
de: _Bearbeiten

source: _Program
de: _Programm

source: _View
de: _Ansicht
fr: _Affichage

source: _Help
de: _Hilfe
fr: _Aide

source: Toggle Emergency Stop [F1]
de: Not Aus ändern [F1]
fr: Arret d'urgence On/Off [F1]

source: Toggle machine power [F2]
de: Maschine ein/aus [F2]

source: Open G-Code file [O]
de: Öffne G-Code Datei [O]
fr: Ouvre fichier G-code [O]

source: Reopen current file [Control-R]
de: Aktuelle Datei nochmals öffnen [Strg-R]
fr: Recharge le fichier courant [Control-R]

source: Begin executing current file [R]
de: Führe aktuelle Datei aus [R]
fr: Demarre fichier courant [R]

source: Execute next line [T]
de: Führe nächste Zeile aus [T]
fr: Executer la ligne suivante [T]

source: Pause [P] / resume [S] execution
de: Pause [P] / weitermachen [S]
fr: Pause [P] / reprendre [s] execution

source: Stop program execution [ESC]
de: Stoppe Programmausführung [ESC]
fr: Stopper execution programme [ESC]

source: Zoom in [+]
de: Zoom rein [+]
fr: Zoom avant [+]

source: Zoom out [-]
de: Zoom raus [-]
fr: Zoom arriere [-]

source: Clear live plot [Ctrl-K]
de: Ansicht löschen [Strg-K]
fr: Effacer la trace de l'outil [Ctrl-K]

source: Manual Control [F3]
de: Manuelle Kontrolle [F3]
fr: Controle manuel [F3]

source: Code Entry [F5]
de: Kodeingabe (MDI) [F5]
fr: Commande manuelle [F5]

source: Axis:
de: Achse:
fr: Axe:

source: Home
de: Referenz Position
fr: Position Home

source: Spindle:
de: Spindel:
fr: Broche:

source: Brake
de: Bremse
fr: Frein

source: Coolant:
de: Kühlung:
fr: Options:

source: Mist
de: Nebel
fr: Aspiration

source: Flood
de: Kühlmittel
fr: Arrosage

source: History:
de: Geschichte:
fr: Historique:

source: MDI Command:
de: MDI Kommando:
fr: Commande MDI

source: Go
de: Führe aus
fr: Demarrer

source: Active G-Codes:
de: Aktive G-Wörter:
fr: G-Codes actifs:

source: Feed Override (%):
de: Geschwindigkeits Übersteuerung (%):
fr: Vitesse : (%)

source: AXIS (No file)
de: AXIS (keine Datei)
fr: AXIS (Pas de fichier)

source: Machine
de: Maschine
fr: Macchine

source: Relative
de: Relativ

source: Actual
de: Aktuell
fr: Actuelle

source: Commanded
de: Befohlen
fr: Commandee

source: Turn spindle counterclockwise [F10]
de: Spindel dreht gegen Uhrzeigersinn [F10]
fr: Broche sens antihoraire [F10]

source: Turn spindle clockwise [F9]
de: Spindel dreht im Urhzeigersinn [F9]
fr: Broche sens horaire [F9]

source: Stop spindle [F9/F10]
de: Spindel stoppen [F9/F10]
fr: Stopper broche [F9/F10]

source: Turn spindle Faster [F12]
de: Spindel schneller drehen [F12]
fr: Accelerer broche [F12]

source: Turn spindle Slower [F11]
de: Spindel langsamer drehen [F12]
fr: Ralentir broche [F11]

source: Turn spindle brake on [Shift-B] or off [B]
de: Spindelbremse an [Shift-B] oder aus [B]
fr: Frein de broche On/Off [Shift-B/B]

source: Turn flood on or off [F8]
de: Kühlmittel an/aus [F8]
fr: Arrosage On/Off [F8]

source: Turn mist on or off [F7]
de: Nebel an/aus [F7]
fr: Aspiration On/Off [F7]

source: Send active axis home [Home]
de: Sende aktive Achse zur Referenz position [Pos1]
fr: Envoyer l'axe actif a la position Home [Home]

source: Set G54 offset for active axis [Shift-Home]
de: Setze G54 Offset für die aktive Achse [Shift-Pos1]
fr: Fixer le decalage G54 pour l'axe courant [Shift-Home]

source: Activate axis [X]
de: Aktiviere Achse [X]
fr: Activer axe X [X]

source: Activate axis [Y]
de: Aktiviere Achse [Y]
fr: Activer axe Y [Y]

source: Activate axis [Z]
de: Aktiviere Achse [Z]
fr: Activer axe Z [Z]

source: Activate axis [A]
de: Aktiviere Achse [A]
fr: Activer axe A [A]

source: Activate axis [4]
de: Aktiviere Achse [4]
fr: Activer axe 4 [4]

source: Activate axis [5]
de: Aktiviere Achse [5]
fr: Activer axe 5 [5]

source: Temporarily allow jogging outside machine limits [L]
de: Momentare Erlaubniss Maschine ausserhalb des erlaubten Bereichs zu joggen [L]
fr: Permettre temporairement des deplacements hors limites [L]

source: Unexpected end of file
de: Unerwartetes Ende der Datei

source: Internal error: A file is already open
de: Interner fehler: Eine Datei ist schon offen

source: All axes missing with G92
de: Keine Koordinaten für g92 angegeben

source: All axes missing with motion code
de: Keine Koordinaten für Wegbedingung angegeben

source: Arc radius too small to reach endpoint
de: Kreisradius zu klein zum Erreichen des Endpunktes

source: Argument to ACOS out of range
de: Argument ACOS außerhalb des gültigen Bereiches

source: Argument to ASIN out of range
de: Argument ASIN außerhalb des gültigen Bereiches

source: Division by zero
de: Division durch Null

source: Attempt to raise negative number to non-integer power
de: Versuch eine negative Zahl mit einem nicht-ganzzahligem Wert zu potenzieren

source: Bad character
de: Ungültiges Zeichen

source: Non-digit found where integer expected
de: Falsches Zahlenformat (integer erwartet)

source: Unexpected character found where +, -, . or digit expected
de: Ungültiges Zeichen gefunden, da wo +, -, . oder nummer erwartet wurde

source: Internal error: NCE_BUG_BAD_G_CODE_MODAL_GROUP_0
de: Fehler: Falscher G-Code in Modal-Gruppe 0

source: Internal error: NCE_BUG_CODE_NOT_G0_OR_G1
de: Fehler: Programm-Code ist nicht g0 oder g1

source: Internal error: NCE_BUG_CODE_NOT_G17_G18_OR_G19
de: Fehler: Programm-Code ist nicht g17, g18 oder g19

source: Internal error: NCE_BUG_CODE_NOT_G20_OR_G21
de: Fehler: Programm-Code ist nicht g20 oder g21

source: Internal error: NCE_BUG_CODE_NOT_G28_OR_G30
de: Fehler: Programm-Code ist nicht g28 oder g30

source: Internal error: NCE_BUG_CODE_NOT_G2_OR_G3
de: Fehler: Programm-Code ist nicht g2 oder g3

source: Internal error: NCE_BUG_CODE_NOT_G40_G41_OR_G42
de: Fehler: Programm-Code ist nicht g40, g41 oder g42

source: Internal error: NCE_BUG_CODE_NOT_G43_OR_G49
de: Fehler: Programm-Code ist nicht g43 oder g49

source: Internal error: NCE_BUG_CODE_NOT_G4_G10_G28_G30_G53_OR_G92_SERIES
de: Fehler: Programm-Code ist nicht g4, g10, g28, g30, g53 oder g92-Serie

source: Internal error: NCE_BUG_CODE_NOT_G61_G61_1_OR_G64
de: Fehler: Programm-Code ist nicht g61, g61.1 oder g64

source: Internal error: NCE_BUG_CODE_NOT_G90_OR_G91
de: Fehler: Programm-Code ist nicht g90 oder g91

source: Internal error: NCE_BUG_CODE_NOT_G93_OR_G94
de: Fehler: Programm-Code ist nicht g93 oder g94

source: Internal error: NCE_BUG_CODE_NOT_G98_OR_G99
de: Fehler: Programm-Code ist nicht g98 oder g99

source: Internal error: NCE_BUG_CODE_NOT_IN_G92_SERIES
de: Fehler: Programm-Code ist nicht aus g92-Serie

source: Internal error: NCE_BUG_CODE_NOT_IN_RANGE_G54_TO_G593
de: Fehler: Programm-Code ist nicht im Bereich g54 bis g593

source: Internal error: NCE_BUG_CODE_NOT_M0_M1_M2_M30_M60
de: Fehler: Programm-Code ist nicht m0, m1, m2, m30 oder m60

source: Internal error: NCE_BUG_DISTANCE_MODE_NOT_G90_OR_G91
de: Fehler: Maßangabe-Modus ist nicht g90 oder g91

source: Internal error: NCE_BUG_FUNCTION_SHOULD_NOT_HAVE_BEEN_CALLED
de: Fehler: Funktion sollte nicht aufgerufen werden

source: Internal error: NCE_BUG_IN_TOOL_RADIUS_COMP
de: Fehler bei Werkzeugbahnkorrektur

source: Internal error: NCE_BUG_PLANE_NOT_XY_YZ_OR_XZ
de: Fehler: Fläche nicht in xy-, yz- oder xz-Ebene

source: Internal error: NCE_BUG_SIDE_NOT_RIGHT_OR_LEFT
de: Fehler: Seite nicht rechts oder links

source: Internal error: NCE_BUG_UNKNOWN_MOTION_CODE
de: Fehler: Unbekannte Wegbedingung

source: Internal error: NCE_BUG_UNKNOWN_OPERATION
de: Fehler: Unbekannte Operation

source: Cannot change axis offsets with cutter radius compensation
de: Der Offset einer Achse kann nicht geändert werden, wenn Werkzeugbahnkorrektur aktiv ist

source: Cannot change units with cutter radius compensation
de: Die aktuelle verwendete Maßeinheit (Inch oder mm) kann nicht bei aktiver Werkzeugbahnkorrektur geändert werden

source: Internal error: NCE_CANNOT_CREATE_BACKUP_FILE
de: Fehler: Kann Backup Datei nicht erstellen

source: Cannot do G1 with zero feed rate
de: G1 kann nicht mit einer Vorschubgeschwindigkeit von 0 ausgeführt werden

source: Cannot do zero repeats of a cycle
de: Null Wiederholungen eines Zyklus

source: Cannot do arc with zero feed rate
de: Kreisbogen mit Vorschubgeschwindigkeit von 0 ist nicht möglich

source: Cannot move rotary axes while probing
de: Rotations-Achse kann während einer Abtast-Fahrt nicht bewegt werden

source: Internal error: NCE_CANNOT_OPEN_BACKUP_FILE
de: Fehler: Kann Backup-Datei nicht öffnen

source: Internal error: NCE_CANNOT_OPEN_VARIABLE_FILE
de: Fehler: Kann Variablen-Datei nicht öffnen

source: Cannot probe in inverse time feed mode
de: Abtast-Fahrten sind im zeitreziproken Vorschub-Modus nicht möglich

source: Cannot probe with cutter radius compensation
de: Abtast-Fahrten sind bei aktiver Werkzeugbahnkorrektur nicht möglich

source: Cannot probe with zero feed rate
de: Abtast-Fahrten mit einer Verfahrgeschwindigkeit von 0 sind nicht möglich

source: Cannot put a B in a canned cycle
de: Angabe des Koordinaten-Wortes B in Arbeitszyklen ist nicht erlaubt

source: Cannot put a C in a canned cycle
de: Angabe des Koordinaten-Wortes C in Arbeitszyklen ist nicht erlaubt

source: Cannot put an A in a canned cycle
de: Angabe des Koordinaten-Wortes A in Arbeitszyklen ist nicht erlaubt

source: Cannot turn cutter radius compensation on when out of XY plane (G17)
de: Werkzeugbahnkorrektur funktioniert nur innerhalb der XY-Ebene (G17)

source: Cannot turn cutter radius on when it is already on
de: Werkzeugbahnkorrektur kann nicht aktiviert werden wenn sie schon aktiv ist

source: Cannot put an A word here
de: Das Koordinaten-Wort A kann hier nicht verwendet werden

source: Cannot use axis values with G80
de: Keine Koordinaten-Angabe zusammen mit g80 möglich

source: Cannot use an axis word without a G code that uses them
de: Koordinaten-Angaben können nur zusammen mit einem passenden G-Code verwendet werden

source: Cannot put a B word here
de: Das Koordinaten-Wort B kann hier nicht verwendet werden

source: Cannot put a C word here
de: Das Koordinaten-Wort C kann hier nicht verwendet werden

source: Cannot use G28 or G30 with cutter radius compensation
de: g28 oder g30 kann bei aktiver Werkzeugbahnkorrektur nicht verwendet werden

source: Cannot use G53 with incremental mode
de: g53 kann nicht im inkrementalen Maßangabe-Modus benutzt werden

source: Cannot use G53 with cutter compensation
de: g53 kann bei aktiver Werkzeugbahnkorrektur nicht verwendet werden

source: Cannot use two G codes that use axis words
de: Es können nicht zwei G-codes mit Koordinaten-Angaben pro Zeile verwendet werden

source: Cannot use XZ plane with cutter radius compensation
de: XZ-Ebene kann nicht bei aktiver Werkzeugbahnkorrektur benutzt werden

source: Cannot use YZ plane with cutter radius compensation
de: YZ-Ebene kann nicht bei aktiver Werkzeugbahnkorrektur benutzt werden

source: Line too long
de: Zeile zu lang

source: Cannot have concave corners with cutter radius compensation
de: Konkave Ecke mit aktiver Werkzeugbahnkorrektur sind nicht erlaubt

source: Parameter 5220 (work coordinate system index) out of range
de: Koordinaten-System Index-Parameter 5220 ausserhalb des gültigen Bereichs

source: Cannot start and end an R-format arc at the same place
de: Bei R-Format Kreise ist es verboten Start und Endpunkt an der selber Stelle zu haben

source: Arc would result in gouging with cutter radius compensation
de: Kreiskonturverletzung bei Werkzeugbahnkorrektur

source: Cannot put a D word here (requires G41 or G42)
de: Benutzung eines D-Wortes ohne Angabe von G41 oder G42

source: Dwell time required with G4
de: Verweilzeit-Angabe fehlt bei G4

source: Dwell time required with G82
de: Verweilzeit-Angabe fehlt bei G82

source: Dwell time required with G86
de: Verweilzeit-Angabe fehlt bei G86

source: Dwell time required with G88
de: Verweilzeit-Angabe fehlt bei G88

source: Dwell time required with G89
de: Verweilzeit-Angabe fehlt bei G89

source: Equal sign missing in parameter setting
de: Gleichheitszeichen fehlt beim Setzen eines Parameters

source: F word required with inverse time arc move
de: Angabe eines F-Wortes zum Fahren eines Kreisbogens im zeitreziproken Vorschub-Modus fehlt

source: F word required with inverse time G1 move
de: Angabe eines F-Wortes zum Verfahren mit g1 im zeitreziproken Vorschub-Modus fehlt

source: File ended with no percent sign
de: Es fehlt ein Prozent-Zeichen am Ende der Datei

source: File ended with no percent sign or program end
de: Es fehlt ein Prozent-Zeichen oder Programmende am Ende der Datei

source: Internal error: NCE_FILE_NAME_TOO_LONG
de: Fehler: Dateiname zu lang

source: Internal error: NCE_FILE_NOT_OPEN
de: Fehlere: Datei nicht geöffnet

source: G code out of range
de: Wegbedingung außerhalb des erlaubten Bereiches

source: Cannot put a H word here (requires G43)
de: Unerlaubte Benutzung eines H-Wortes (G43 erforderlich)

source: Cannot put an I word here (invalid plane)
de: Angabe eines I-Wortes für einen Kreisbogen in der yz-Ebene

source: I word required with G87
de: I-Wort notwendig bei G87

source: Cannot put an I word here (Only G2, G3, G87)
de: Unerlaubte Benutzung eines I-Wortes (nur bei G2, G3, G87)

source: Cannot put a J word here (invalid plane)
de: Angabe eines J-Wortes für einen Kreisbogen in der yz-Ebene

source: J word reqired with G87
de: J-Wort notwendig bei G87

source: Cannot put a J word here (Only G2, G3, G87)
de: Unerlaubte Benutzung eines J-Wortes (nur bei G2, G3, G87)

source: Cannot put a K word here (invalid plane)
de: Angabe eines K-Wortes für einen Kreisbogen in der xy-Ebene

source: K word required with G87
de: K-Wort notwendig bei G87

source: Cannot put a K word here (Only G2, G3, G87)
de: Unerlaubte Benutzung eines K-Wortes (nur bei G2, G3, G87)

source: L word requires canned cycle or G10
de: Angabe eines L-Wortes ohne zugehörigen Arbeitszyklus oder G10

source: Left bracket missing after slash with ATAN
de: Fehlende linke Klammer nach Schrägstrich bei atan

source: Left bracket missing after unary operation
de: Fehlende linke Klammer nach unare Operation

source: Line number greater than 99999
de: Zeilennummer größer als 99999

source: NCE_LINE_WITH_G10_DOES_NOT_HAVE_L2
de: Zeile mit G10 enthält kein L2

source: M code out of range (Must not be greater than 199)
de: M Kommando ungültig (Darf nicht größer als 199 sein)

source: R word and I/J/K words may not appear together for an arc
de: Radius- und IJK-Format dürfen nicht zusammen verwendet werden

source: Multiple A words on line
de: Mehrere A-Worte in einer einzelnen Zeile

source: Multiple B words on line
de: Mehrere B-Worte in einer einzelnen Zeile

source: Multiple C words on line
de: Mehrere C-Worte in einer einzelnen Zeile

source: Multiple D words on line
de: Mehrere D-Worte in einer einzelnen Zeile

source: Multiple F words on line
de: Mehrere F-Worte in einer einzelnen Zeile

source: Multiple H words on line
de: Mehrere H-Worte in einer einzelnen Zeile

source: Multiple I words on line
de: Mehrere I-Worte in einer einzelnen Zeile

source: Multiple J words on line
de: Mehrere J-Worte in einer einzelnen Zeile

source: Multiple K words on line
de: Mehrere K-Worte in einer einzelnen Zeile

source: Multiple L words on line
de: Mehrere L-Worte in einer einzelnen Zeile

source: Multiple P words on line
de: Mehrere P-Worte in einer einzelnen Zeile

source: Multiple Q words on line
de: Mehrere Q-Worte in einer einzelnen Zeile

source: Multiple R words on line
de: Mehrere R-Worte in einer einzelnen Zeile

source: Multiple S words on line
de: Mehrere S-Worte in einer einzelnen Zeile

source: Multiple T words on line
de: Mehrere T-Worte in einer einzelnen Zeile

source: Multiple X words on line
de: Mehrere X-Worte in einer einzelnen Zeile

source: Multiple Y words on line
de: Mehrere Y-Worte in einer einzelnen Zeile

source: Multiple Z words on line
de: Mehrere Z-Worte in einer einzelnen Zeile

source: Must use G0 or G1 with G53
de: G53 muß immer zusammen mit G0 oder G1 benutzt werden

source: Negative argument to SQRT
de: SQRT mit negativem Argument

source: Negative D word tool radius index used
de: Negative Zahl bei bei D-Wort (Werkzeug-Radius als Index in der Werkzeug-Tabelle)

source: Negative F word used
de: F-Wort mit negativer Zahl

source: Negative G word used
de: G-Wort mit negativer Zahl

source: Negative H word tool length offset index used
de: Negative Zahl bei bei H-Wort (Werkzeug-Länge als Index in der Werkzeug-Tabelle)

source: Negative L word used
de: L-Wort mit negativer Zahl

source: Negative M code used
de: M-Wort mit negativer Zahl

source: Negative or zero Q value used
de: Q-Wert negativ oder gleich Null

source: Negative P word used
de: P-Wort mit negativer Zahl

source: Negative spindle speed used
de: Negative Spindelgeschwindigkeit

source: Negative tool ID used
de: Negativer Werkzeugtabellen-Id verwendet

source: Nested comment found
de: Verschachtelter Kommentar entdeckt

source: No characters found when reading real value
de: Reelle Zahl erwartet, aber keinerlei Zeichen gefunden

source: No digits found where real number should be
de: Reelle Zahl erwartet, aber keinerlei Ziffern gefunden

source: Non-integer value found where integer required
de: Ganze Zahl erwartet, aber Nichtganzzahl gefunden

source: Internal error: NCE_NULL_MISSING_AFTER_NEWLINE
de: Fehler: Fehlende Null nach Zeilenschaltung

source: Offset index missing
de: Offset Index fehlt

source: P must be an integer with G10 L2
de: P muss Ganzzahlig sein mit G10 L2

source: P out of range with G10 L2
de: P-Wert ausserhalb des gültigen Bereichs bei G10 L2

source: P word with no G4, G10, G82, G86, G88, or G89
de: P-Wort ohne G4, G10, G82, G86, G88 oder G89 benutzt

source: Internal error: NCE_PARAMETER_FILE_OUT_OF_ORDER
de: Fehler: Parameter-Datei nicht in Ordnung

source: Parameter number out of range
de: Parameternummer auserhalb gültigem Bereich

source: Q word missing with G83
de: Q Wort fehlt bei G83

source: Q word without G83
de: Q Wort ohne G83

source: Internal error: NCE_QUEUE_IS_NOT_EMPTY_AFTER_PROBING
de: Fehler: Warteschlange ist nach Abtast-Fahrt nicht leer

source: R clearance plane unspecified in canned cycle
de: Angabe einer R-Abstands-Ebene für den Zklyus fehlt

source: Arc center unspecified (No R, I, J, or K words)
de: Angabe von R, I, J oder K fehlt bei einem Kreisbogen

source: R less than X in canned cycle in YZ plane
de: R ist kleiner als X während eines Zyklus in der YZ-Ebene

source: R less than Y in canned cycle in XZ plane
de: R ist kleiner als Y während eines Zyklus in der YZ-Ebene

source: R less than Z in canned cycle in YX plane
de: R ist kleiner als Z während eines Zyklus in der XY-Ebene

source: R word with G-code that does not use it
de: Koordinaten-Wort R ohne zugehöriges G-Wort

source: Distance from center of arc to endpoints differs
de: Abstände vom Zentrum zu Start- und Endpunkte sind verschieden

source: Arc radius too small to reach end point
de: Radius zu klein zum Erreichen des Endpunktes

source: Required parameter missing
de: Benötigter Parameter fehlt

source: Tool slot number too large
de: Angegebene Werkzeug-Nummer zu groß
