Repository: KurtJacobson/axis-historical
Catalog: i18n/*.po
Languages: de, fr

source: Slash missing after first ATAN argument
de: Fehlender Schrägstrich nach dem ersten Argument in einer ATAN-Funktion

source: Spindle not turning clockwise in G84
de: G84, aber Werkzeug-Spindel dreht sich nicht im Uhrzeigersin

source: Spindle not turning in G86
de: G86, Spindel dreht nicht

source: Spindle not turning in G87
de: G87, Spindel dreht nicht

source: Spindle not turning in G88
de: G88, Spindel dreht nicht

source: Non-number found where number expected ("scanf()" failed)
de: Zeichen gefunden wo Nummern erwartet wurden ("scanf()" nicht erfolgreich beendet)

source: Start point too close to probe point
de: Startpunkt zu dicht am Abtast-Punkt

source: Too many M codes on line
de: Zu viele M-Codes auf einer Zeile

source: Too length offset index too big
de: Werkzeug-Längen-Index zu groß

source: Index in tool table file too large
de: Werkzeug-Datei-Index zu groß

source: Tool radius index too big
de: Werkzeug-Radius-Index zu groß

source: Tool radius must be less than arc radius with cutter compensation
de: Werkzeugradius muss kleiner als Kreisradius bei aktiver Werkzeugbahnkorrektur sein

source: Two G codes from same modal group
de: Gleichzeitige Benutzung von zwei G-Kommandos aus der selben modalen Gruppe

source: Two M codes from same modal group
de: Gleichzeitige Benutzung von zwei M-Kommandos aus der selben modalen Gruppe

source: Unable to open file
de: Datei kann nicht geöffnet werden

source: Unclosed comment
de: Nicht abgeschlossener Kommentar

source: Unclosed expression
de: Nicht abgeschlossener Ausdruck

source: Unknown G code
de: Unbekanntes G-Kommando

source: Unknown M code
de: Unbekanntes M-Kommando

source: Unknown operation
de: Unbekannte Operation

source: Unknown operation name starting with A
de: Unbekannte Operation beginnend mit A

source: Unknown operation name starting with M
de: Unbekannte Operation beginnend mit M

source: Unknown operation name starting with O
de: Unbekannte Operation beginnend mit O

source: Unknown operation name starting with X
de: Unbekannte Operation beginnend mit X

source: Unknown word starting with A
de: Unbekanntes Wort beginnend mit A

source: Unknown word starting with C
de: Unbekanntes Wort beginnend mit C

source: Unknown word starting with E
de: Unbekanntes Wort beginnend mit E

source: Unknown word starting with F
de: Unbekanntes Wort beginnend mit F

source: Unknown word starting with L
de: Unbekanntes Wort beginnend mit L

source: Unknown word starting with R
de: Unbekanntes Wort beginnend mit R

source: Unknown word starting with S
de: Unbekanntes Wort beginnend mit S

source: Unknown word starting with T
de: Unbekanntes Wort beginnend mit T

source: Unknown word where unary operation could be
de: Unbekanntes Wort, wo unäre Operation erwartet

source: X and Y words missing for arc in XY plane
de: X- und Y-Worte fehlen für einen Kreisbogen in der XY-Ebene

source: X and Z words missing for arc in XZ plane
de: X- und Z-Worte fehlen für einen Kreisbogen in der XZ-Ebene

source: X value unspecified in YZ plane in a canned cycle
de: Keine Angabe eines X-Wertes bei Arbeitszyklus in XZ-Ebene

source: X, Y, and Z words all missing with g38.2
de: Keine Angabe eines X-, Y- und Z-Wortes bei G38.2

source: Y and Z words missing for arc in YZ plane
de: Y- und Z-Worte fehlen für einen Kreisbogen in der YZ-Ebene

source: Y value unspecified in XZ plane in a canned cycle
de: Keine Angabe eines Y-Wertes bei Arbeitszyklus in XZ-Ebene

source: Z value unspecified in XY plane in a canned cycle
de: Keine Angabe eines Z-Wertes bei Arbeitszyklus in XY-Ebene

source: Zero or negative argument to LN
de: Argument der LN-Funktion kleiner oder gleich Null

source: Zero radius arc
de: Null Radius

source: Tool %d, offset %g, diameter %g
fr: Outil %d, decalage %g, diametre %g

source: G-Code error in %s
fr: Erreur G-code dans %s

source: Near line %d of %s: %s
fr: Ligne proche %d de %s: %s

source: _Reload
fr: _Recharge

source: Toggle _Emergency Stop
fr: _Arret d'urgence On/Off

source: Toggle _Machine Power
fr: _Puissance machine On/Off

source: Set _next line
fr: Selectionner la prochaine ligne

source: _Run program
fr: _Demarrer programme

source: _Top view
fr: Vue de _dessus

source: _Rotated Top view
fr: Vue de dessus _inversée

source: _Side view
fr: Vue de _cote

source: _Front view
fr: Vue de _face

source: _Perspective view
fr: Vue en perspective

source: Display _Inches
fr: Affichage en _pouces

source: Display _MM
fr: Affichage en _mm

source: S_how program
fr: Voir _programme

source: Sho_w live plot
fr: Voir la _trace de l'outil

source: Show too_l
fr: Voir l'_outil

source: Show e_xtents
fr: Voir les limites

source: Show commanded position
fr: Voir la position _commandee

source: Show actual position
fr: Voir la position _actuelle

source: Show machine position
fr: Voir la position _machine

source: Show relative position
fr: Voir la position _relative

source: _About AXIS
fr: _A propos d'AXIS

source: Quick _Reference
fr: Aide _Rapide

source: Top view
fr: Vue de dessus

source: Rotated top view
fr: Vue de dessus inversée

source: Side view
fr: Vue de cote

source: Front view
fr: Vue de face

source: Perspective view
fr: Vue en perspective

source: Offset
fr: Decalage

source: Stop
fr: Arret

source: AXIS version $version Copyright (C) 2004, 2005, 2006 Jeff Epler and Chris Radek. This is free software, and you are welcome to redistribute it under certain conditions. See the file COPYING, included with AXIS. Visit the AXIS web site:
fr: AXIS version $version Copyright (C) 2004, 2005, 2006 Jeff Epler et Chris Radek. Ceci est un logiciel libre, et vous etes invites a le redistribuer sous certaines conditions. Voir le fichier COPYING, fourni avec AXIS. Traduction française : D. Lacombe Visiter le site web d'AXIS:

source: About AXIS
fr: A propos d'AXIS

source: AXIS Quick Reference
fr: Aide rapide AXIS

source: ESTOP
fr: Arret d'urgence

source: ESTOP RESET
fr: Attente puissance machine

source: Jog selected axis
fr: Deplacer l'axe actif

source: Select jog ingrement
fr: Selectionner l'increment de deplacement
